print("Пин код оруулна уу")
пин = int(input())
үлдэгдэл = 10000
if пин == 1234:
    pass
else:
    print("Буруу байна, дахиад оролдоно уу")
    пин = int(input())
    if пин == 1234:
        pass
    else:
        print("нэг оролдлого үлдлээ")
        пин = int(input())
        if пин == 1234:
            pass
        else:
            print("Таны карт блокдлогдлов")
while пин == 1234:
    зарлага = 0
    орлого = 0
    print(" 1. Зарлага ")
    print(" 2. Орлого ")
    print("3. Шилжүүлэг ")
    print("4. Үлдэгдэл шалгах ")
    a = int(input())
    if a == 1:
        print("Мөнгөн дүнг оруулна уу")
        зарлага = int(input())
        if зарлага > 10000:
            print("үлдэгдэл хүрэхгүй байна")
        else:
            үлдэгдэл = үлдэгдэл - зарлага
            print(" Амжилттай " + str(зарлага) + " төгрөг гарч " + str(үлдэгдэл) + " төгрөг үлдэв ")
        print("1.Дахин гүйлгээ хийх")
        print("2.Картаа авах")
        b = int(input())
        if b == 1:
            pass
        else:
            print("Картаа авна уу")
    if a == 2:
        print("Өөрийн дансанд хийх мөнгөн дүнг оруулна уу")
        c = int(input())
        үлдэгдэл = үлдэгдэл + c
        print("Таны дансны үлдэгдэл " + str(үлдэгдэл) + " төгрөг болов")
        print("1.Дахин гүйлгээ хийх")
        print("2.Картаа авах")
        b = int(input())
        if b == 1:
            pass
        else:
            print("Картаа авна уу")
    if a == 3:
        print("Дансны дугаар")
        d = int(input())
        print("ГА**** Б***")
        print("Шилжүүлэх мөнгөн дүнг оруулна уу")
        e = int(input())
        if e > үлдэгдэл:
            print("Дансны үлдэгдэл хүрэхгүй байна")
        else:
            print("Амжилттай")
            үлдэгдэл = үлдэгдэл - e
            print("Таны дансны үлдэгдэл " + str(үлдэгдэл) + " төгрөг болов")
        print("1.Дахин гүйлгээ хийх")
        print("2.Картаа авах")
        b = int(input())
        if b == 1:
            pass
        else:
            print("Картаа авна уу")
    if a == 4:
        print(" Таны дансны үлдэгдэл " + str(үлдэгдэл) + " төгрөг байна")
        print("1.Дахин гүйлгээ хийх")
        print("2.Картаа авах")
        b = int(input())
        if b == 1:
            pass
        else:
            print("Картаа авна уу")
